#include "uart.h"

void Uart3_Init( void )	//115200bps@11.0592MHz
{
	P_SW2 |= 0X00;			//串口3功能脚选择P0.0 P0.1

	S3CON  = 0x10;		    //8位数据,可变波特率

	S3CON |= 0x40;			//串口3选择定时器3为波特率发生器

	T4T3M |= 0x02;			//定时器时钟1T模式

	T3L    = 0xE8;				//设置定时初始值
	T3H    = 0xFF;				//设置定时初始值

	T4T3M |= 0x08;			//定时器3开始计时

	IE2   |= 0x08;		// 串口3中断打开	
}

void Uart4_Init( void )	//115200bps@11.0592MHz
{
	P_SW2 |= 0X00;			//串口4功能脚选择P0.2 P0.3

	S4CON  = 0x10;		//8位数据,可变波特率
	S4CON |= 0x40;		//串口4选择定时器4为波特率发生器
	T4T3M |= 0x20;		//定时器时钟1T模式
	T4L    = 0xE8;		//设置定时初始值
	T4H    = 0xFF;		//设置定时初始值
	T4T3M |= 0x80;		//定时器4开始计时

	IE2   |= 0x10;      // 串口4中断打开
}
